# Querying Multiple Tables

In [1]:
import pandas as pd
import pymysql

In [2]:
# Database connection
try:
    conn = pymysql.connect(
        host='localhost',
        user='newuser',
        passwd='password',
        db='sakila'
    )
    print('Connection established:\n', conn)
except (pymysql.err.OperationalError, pymysql.err.InternalError) as e:
    print("Ocurri√≥ un error al conectar: ", e)

Connection established:
 <pymysql.connections.Connection object at 0x7f522ac97af0>

## Exercise 5-1

Fill in the blanks (denoted by <#>) for the following query to obtain the results that follow:...

In [3]:
pd.read_sql_query(
    "SELECT c.first_name, c.last_name, a.address, ct.city\
       FROM customer c\
       INNER JOIN address a\
       ON c.address_id = a.address_id\
       INNER JOIN city ct\
       ON a.city_id = ct.city_id\
       WHERE a.district = 'California'", 
    conn)

  first_name  last_name                 address            city
0   PATRICIA    JOHNSON        1121 Loja Avenue  San Bernardino
1      BETTY      WHITE    770 Bydgoszcz Avenue  Citrus Heights
2      ALICE    STEWART  1135 Izumisano Parkway         Fontana
3       ROSA   REYNOLDS     793 Cam Ranh Avenue       Lancaster
4      RENEE       LANE    533 al-Ayn Boulevard         Compton
5    KRISTIN   JOHNSTON         226 Brest Manor       Sunnyvale
6  CASSANDRA    WALTERS     920 Kumbakonam Loop         Salinas
7      JACOB      LANCE    1866 al-Qatif Avenue        El Monte
8       RENE  MCALISTER  1895 Zhezqazghan Drive    Garden Grove

## Exercise 5-2

Write a query that returns the title of every film in which an actor with the first name JOHN appeared.

In [11]:
pd.read_sql_query(
    "SELECT f.title\
       FROM film f\
         INNER JOIN film_actor fa\
         ON f.film_id = fa.film_id\
         INNER JOIN actor a\
         ON fa.actor_id = a.actor_id\
       WHERE a.first_name = 'JOHN'", 
    conn)

                        title
0             ALLEY EVOLUTION
1              BEVERLY OUTLAW
2              CANDLES GRAPES
3             CLEOPATRA DEVIL
4          COLOR PHILADELPHIA
5              CONQUERER NUTS
6            DAUGHTER MADIGAN
7         GLEAMING JAWBREAKER
8             GOLDMINE TYCOON
9                   HOME PITY
10         INTERVIEW LIAISONS
11           ISHTAR ROCKETEER
12               JAPANESE RUN
13               JERSEY SASSY
14                 LUKE MUMMY
15                MILLION ACE
16          MONSTER SPARTACUS
17             NAME DETECTIVE
18          NECKLACE OUTBREAK
19              NEWSIES STORY
20               PET HAUNTING
21           PIANIST OUTFIELD
22            PINOCCHIO SIMON
23       PITTSBURGH HUNCHBACK
24                QUILLS BULL
25            RAGING AIRPLANE
26              ROXANNE REBEL
27  SATISFACTION CONFIDENTIAL
28                SONG HEDWIG

## Exercise 5-3

Construct a query that returns all addresses that are in the same city.

In [15]:
pd.read_sql_query(
    "SELECT a1.address addr1, a2.address addr2, a1.city_id\
       FROM address a1\
         INNER JOIN address a2\
         ON a1.city_id = a2.city_id\
           AND a1.address < a2.address", 
    conn)

                  addr1               addr2  city_id
0     23 Workhaven Lane   47 MySakila Drive      300
1  1411 Lillydale Drive  28 MySQL Boulevard      576
2     1497 Yuzhou Drive  548 Uruapan Street      312
3      43 Vilnius Manor  587 Benguela Manor       42

In [18]:
conn.close()